app/controllers/answers_controller.rb

  def create
    authorize! :create, Answer
    @answer = current_user.answers.new(answer_params.merge(question: @question))
    @comment = Comment.new

    if @answer.save
---
INSERT INTO "answers" ("body", "correct", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "MyText"], ["correct", 0], ["question_id", 1], ["created_at", "2020-06-18 22:29:38.532886"], ["updated_at", "2020-06-18 22:29:38.532886"]]

  def update
    authorize! :update, @answer
    @question = @answer.question
    if @answer.update(answer_params)
---
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "new body"], ["updated_at", "2020-06-18 22:29:38.591160"], ["id", 1]]

  def destroy
    authorize! :delete, @answer
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]

  def set_answer
    @answer = Answer.with_attached_files.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_question
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]