app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title"], ["body", "body"], ["created_at", "2020-06-17 22:29:28.052192"], ["updated_at", "2020-06-17 22:29:28.052192"]]
---
  def create
    @question = current_user.questions.new(question_params)

    if @question.save

SELECT "questions".* FROM "questions"
UPDATE "questions" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "new body"], ["title", "new title"], ["updated_at", "2020-06-17 22:50:04.953297"], ["id", 1]]
---
  def update
    @questions = Question.all
    if @question.update(question_params)

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    if current_user.author_of?(@question)
      @question.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_question
    @question = Question.with_attached_files.find(params[:id])